Though we've only just begun our dive into /Bananas, Lenses, Envelopes, and Barbed Wire/, the next natural step in understanding recursion schemes brings us outside its purview. We must turn our attention to a paper written seven years later---/[[http://cs.ioc.ee/~tarmo/papers/inf99.pdf][Primitive(Co)Recursion and Course-of-Value (Co)Iteration, Categorically]]/, by Tarmo Uustalu and Varmo Vene. /Primitive (Co)Recursion/ explores and formalizes the definition of apomorphisms (introduced first by Meijer et al., and which we discussed, briefly, in the [[https://blog.sumtypeofway.com/posts/recursion-schemes-part-3.html][previous installment]]) and describes two new recursion schemes, the /histomorphism/ and the /futumorphism/.

/Primitive (Co)Recursion/ is a wonderful and illuminating paper, but it is dense in its concepts for those unfamiliar with category theory, and uses the semi-scrutable bracket syntax introduced by /Bananas/. But there's no need for alarm if category theory isn't your cup of tea: Haskell allows us, once again, to express elegantly the new recursion schemes defined in /Primitive (Co)Recursion/. Guided by Uustalu and Vene's work, we'll derive these two new recursion schemes and explore their ways in which they simplify complicated folds and unfolds. Though these new morphisms are, definition-wise, simple variations on paramorphisms and apomorphisms, in practice they provide surprising power and clarity, as Uustalu and Vene assert:

#+BEGIN_QUOTE
  [We] argue that even these schemes are helpful for a declaratively thinking programmer and program reasoner who loves languages of programming and program reasoning where programs and proofs of properties of programs are easy to write and read.
#+END_QUOTE

That sure sounds like us. Let's get going. This article is literate Haskell; you can find the source code [[https://github.com/patrickt/recschemes/blob/master/src/Part4.hs][here]].

#+BEGIN_SRC haskell :tangle ../src/Part4.hs :exports none
* Running a Course with Histomorphisms

Paramorphisms allow us, at each stage of the fold, to view the original structure of the examined node before the fold began. Though this is more powerful than the catamorphism, in many cases it does not go far enough: many useful functions are defined not just in terms of the original argument to the function, but in terms of previous computed values. The classic[fn:3] example is the Fibonacci function, the general case of which is defined in terms of two previous invocations:

#+BEGIN_SRC haskell
fib :: Int -> Int
fib 0 = 0
fib 1 = 1
fib n = fib (n-1) + fib (n-2)
#+END_SRC

We could express this function using a catamorphism---though one of the carrier values (~fib (n-1)~) would be preserved, as the accumulator of our fold, we would need another explicit recursive call to ~cata~ to determine the historical value of ~fib (n-2)~. This is a bummer, both in terms of efficiency---we're recalculating values we've already calculated---and in terms of beauty: a function so fundamental as ~fib~ deserves a better implementation, especially given the expressive power of recursion schemes.

The imperative programmers among us will have a solution to this inefficiency: "iterate!", they will yell, or perhaps they will clamor "introduce a cache!" in a great and terrible voice. And it's true: we could compute ~fib~ with a for-loop or by memoizing the recursive call. But the former approach entails mutable state---an oft-problematic tool, especially to for such a simple problem---and the latter leaves us [[https://twitter.com/importantshock/status/241173326846898176][with two problems]]. Uustalu and Vene's histomorphism provides a way out: we will /preserve the history/ of the values our fold computes, so that further recursive calls to compute past values become unnecessary. This style of recursion is called /course-of-value recursion/, since we record the /values/ evaluated as our fold function /courses/ through the structure.

Rather than operate on an ~f a~, a data structure in the process of being folded, we'll operate on a more sophisticated structure, so that the argument to our fold function contains the history of all applications of the fold itself. Instead of a just a carrier value =a=, our =f= will contain a carrier value and a recursive, unrollable record of past invocations:

#+BEGIN_SRC haskell :tangle ../src/Part4.hs
data Attr f a = Attr
  { attribute :: a
  , hole      :: f (Attr f a)
  }
#+END_SRC

We'll call this ~Attr~, since it's an 'attributed' version of ~Term~.

An ~Attr f a~ contains an ~a~---a carrier value, storing the in-progress value of the fold---as well as a fixed-point value (analogous to ~Term~) at each level of recursion. Thanks to the fixed-point ~hole~ within the ~f~, further ~Attr~ items are preserved, each of which contains the shape of the folded functor ~f~. And within the ~f~ there lie further ~Attr~ values, each of which contains a carrier value yielded by /their/ application in their ~attribute~ slot. And those ~Attr~ values in turn contain further ~hole~ values, which contain the historical records pertaining to /their/ childrens' history, and so on and so forth until the bottom of the data structure has been reached. As such, the entire history of the fold is accessible to us: the ~holes~ preserve the shape of the data structure (which was lost during ~cata~), and the ~attribute~ holds the record of applying the fold to each entity in said data structure.

We have a word for preserving a record of the past, of course---/history/[fn:4]. A fold operation that uses =Attr= to provide both an accumulator and a record of prior invocations is known as a /histomorphism/---a shape-changing (/morpho/) fold with access to its history (/histo/).

Let's define the histomorphism. It will, like its cousins ~cata~ and ~para~, use an algebra for its fold function. But unlike the F-algebra of ~cata~ or the R-algebra of ~para~, we'll be using an algebra that operates on an ~Attr f a~, yielding an ~a~ out of it. We call this a course-of-value algebra, abbreviated to a /CV-algebra/, and define a type alias for it, so we end up with a more comprehensible type signature in the histomorphism:

#+BEGIN_SRC haskell :tangle ../src/Part4.hs
type CVAlgebra f a = f (Attr f a) -> a
#+END_SRC

That is, a CV-algebra maps from a container ~f~ containing children of type ~Attr f a~ (which in turn contain ~f (Attr f a)~ children, as far down as is needed in the nested structure), to a final result type ~a~. The shape of the folded structure and the history of its applications are all contained in its ~Attr~ values: all you have to do is unroll the ~hole~ value to go back one level in history and use ~attribute~ to examine the stored value.

Our ~histo~ function will be similar to ~cata~ and ~para~ at its heart. We start by unpacking the ~Term~---the initial argument must be a ~Term~ rather than an ~Attr~, since as we haven't started the fold yet we have no value to fill in for ~attribute~. We will then recurse, with ~fmap~, into the thus-revealed structure until we hit its root. We then use the CV-algebra to build the value, starting at the root and continuing upwards to the topmost leaf. These steps are analogous to how we defined ~cata~ and ~para~, so let's start defining it:

#+BEGIN_SRC haskell
histo :: Functor f => CVAlgebra f a -> Term f -> a
histo h = out >>> fmap someWorkerFunction >>> h
#+END_SRC

What type should ~someWorkerFunction~ have? Well, we can ask GHC, thanks to one of its most useful features[fn:5]---type holes. By prepending an underscore to the use of ~worker~, we can allow the program compilation to continue as far as is possible---however, when the compilation process has finished, GHC will remind us where we used a type hole, and inform us of the type signature it inferred for ~_worker~. (As a full-time Haskell programmer, I use this feature nearly every day.) After adding this type hole, GHC yields the following type-hole message:

#+BEGIN_SRC haskell :results output :exports both
histo :: Functor f => CVAlgebra f a -> Term f -> a
histo h = out >>> fmap _worker >>> h
#+END_SRC

#+RESULTS:
: /Users/patrick/src/morphisms/src/Main.hs:14:24: error:
:     • Found hole: ‘_worker’ with type :: Term f -> Attr f a

This is quite a helpful error message from GHC, as it gives us a route forward. We're operating on ~Term f~ values (lifted into this context by the ~fmap~ within ~histo~), and we need to yield an ~Attr f a~, so that the outside ~Term f~ can be transformed into an ~f (Attr f a)~ and then passed into the CV-algebra. As such, we need to define a ~worker~ function, taking and returning values of the indicated type, that does the heavy lifting.

An ~Attr f a~, as defined above, contains two values: a plain ~a~ type, and a recursive ~f (Attr f a)~ hole. Given a ~Term f~ and our ability to invoke both ~histo~ and ~worker~ recursively, we can build the ~Attr f a~ we need. Let's start by defining the skeleton of ~worker~: given a ~Term f~, called ~t~, it constructs an ~Attr~, containing two fields.

#+BEGIN_SRC haskell
worker t = Attr _ _
#+END_SRC

The first field, the ~a~, is yielded by recursing with ~histo~ on the provided ~Term~---easy enough. This is just like the catamorphism---indeed, a catamorphism is a histomorphism that ignores the provided history.

#+BEGIN_SRC haskell
worker t = Attr (histo h t) _
#+END_SRC

The second field's construction is more clever: we unwrap ~term~ with the ~out~ function, which gives us an ~f (Term f)~ out of a ~Term f~. Since we don't know exactly what type ~f~ is yet, we can't extract the contained ~Term f~---but we can operate on it, with ~fmap~, provided by the ~Functor~ constraint. So, to go from an ~f (Term f)~ to an ~f (Attr f a)~, we need a function of type ~Term f -> Attr f a~... hang on, that's just ~worker~ itself!

#+BEGIN_SRC haskell
worker t = Attr (histo h t) (fmap worker (out t))
#+END_SRC

This is the heart of ~histo~'s elegance: it's 'doubly recursive', in that its ~worker~ function invokes both ~histo~ and ~worker~ itself.

Now we have a ~histo~ function that passes the typechecker:

#+BEGIN_SRC haskell :tangle ../src/Part4.hs
histo :: Functor f => CVAlgebra f a -> Term f -> a
histo h = out >>> fmap worker >>> h where
    worker t = Attr (histo h t) (fmap worker (out t))
#+END_SRC

However, this function does not share its subcomputations properly: each iteration of ~worker~ recomputes, rather than reuses, all the nested ~hole~ values within the constructed ~Attr~. We can fix this by promoting ~worker~ to operate on ~Attr~ values; by recursing with ~fmap worker~, placing the input and output of the CV-algebra in a tuple with ~&&&~, and then unpacking the tuple into an ~Attr~, we ensure that all the constructed ~Attr~ values share their subcomputations.

#+BEGIN_SRC haskell
histo :: Functor f => CVAlgebra f a -> Term f -> a
histo h = worker >>> attribute where
  worker = out >>> fmap worker >>> (h &&& id) >>> mkAttr
  mkAttr (a, b) = Attr a b
#+END_SRC

What does this function /mean/? We've filled in all these type holes, and we have a working ~histo~ function, but why does it work? Why does this preserve the history?

The answer lies in ~worker~, in the ~id~ function that captures and preserves the ~Attr~ the worker function is operating on. If we omitted that expression, we would have a function equivalent to ~cata~---one that throws all its intermediate variables away while computing the result of a fold. But our worker function ensures that the result computed at each stage is not lost: as we flow, root-to-leaf, upwards through the data structure, we construct a new ~Attr~ value, which in turn contains the previous result, which itself preserves the result before that, and so on. Each step yields an up-to-date snapshot of what we have computed in the past.

By /not throwing out intermediate results/, and pairing these intermediate results with the values used to calculate them, we automatically generate /and update/ a cache for our fold.

Now, I may have used ~fib~ as an example of a course-of-value recursive function, but I won't provide an example of using ~histo~ to calculate the nth Fibonacci number (though it's a good exercise). Let's solve a toy problem that's slightly more interesting, one that histomorphisms make clear and pure, and one whose solution can be generalized to all other problems of its ilk.

